title: LSASS Memory Dump Attempt
id: D-0001
status: experimental
description: Detects potential credential dumping via access to lsass.exe memory.
author: Loren Levy
date: 2026-02-22
references:
  - https://attack.mitre.org/techniques/T1003/001/
tags:
  - attack.credential_access
  - attack.t1003.001
logsource:
  product: windows
  category: process_access
detection:
  selection:
    TargetImage|endswith: '\lsass.exe'
    GrantedAccess|contains:
      - '0x1f3fff'
      - '0x1010'
  condition: selection
falsepositives:
  - Legitimate security software
  - EDR processes with memory inspection rights
level: high